Xinyuan-LilyGO/lilygo-micropython/target/esp32s3/boards/LILYGO_T-DisplayS3-AMOLED/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "T-DisplayS3-AMOLED (OPI RAM)"
#define MICROPY_HW_MCU_NAME "ESP32S3"

#define MICROPY_PY_MACHINE_DAC              (0)

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)
